<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Cleaning-Data" data-toc-modified-id="Cleaning-Data-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Cleaning Data</a></span><ul class="toc-item"><li><span><a href="#Null-values" data-toc-modified-id="Null-values-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Null values</a></span><ul class="toc-item"><li><span><a href="#Cleaning-Null-Values" data-toc-modified-id="Cleaning-Null-Values-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Cleaning Null Values</a></span></li><li><span><a href="#Checking-for-Null-Values" data-toc-modified-id="Checking-for-Null-Values-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>Checking for Null Values</a></span></li><li><span><a href="#Dropping-Null-Values" data-toc-modified-id="Dropping-Null-Values-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>Dropping Null Values</a></span></li><li><span><a href="#Filling-Null-Values" data-toc-modified-id="Filling-Null-Values-1.1.4"><span class="toc-item-num">1.1.4&nbsp;&nbsp;</span>Filling Null Values</a></span></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-1.1.5"><span class="toc-item-num">1.1.5&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Dealing-with-Duplicates" data-toc-modified-id="Dealing-with-Duplicates-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Dealing with Duplicates</a></span><ul class="toc-item"><li><span><a href="#Identifying-Duplicates" data-toc-modified-id="Identifying-Duplicates-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Identifying Duplicates</a></span></li><li><span><a href="#Removing-Duplicates" data-toc-modified-id="Removing-Duplicates-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Removing Duplicates</a></span></li><li><span><a href="#Removing-Duplicates-Based-on-Specific-Columns" data-toc-modified-id="Removing-Duplicates-Based-on-Specific-Columns-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Removing Duplicates Based on Specific Columns</a></span></li><li><span><a href="#Resetting-the-Index" data-toc-modified-id="Resetting-the-Index-1.2.4"><span class="toc-item-num">1.2.4&nbsp;&nbsp;</span>Resetting the Index</a></span></li></ul></li><li><span><a href="#Formatting-Data" data-toc-modified-id="Formatting-Data-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Formatting Data</a></span><ul class="toc-item"><li><span><a href="#Formatting-Numeric-Values" data-toc-modified-id="Formatting-Numeric-Values-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Formatting Numeric Values</a></span></li><li><span><a href="#Formatting-Strings" data-toc-modified-id="Formatting-Strings-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Formatting Strings</a></span></li><li><span><a href="#Formatting-Dates" data-toc-modified-id="Formatting-Dates-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>Formatting Dates</a></span></li></ul></li><li><span><a href="#Cleaning-Column-Names" data-toc-modified-id="Cleaning-Column-Names-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Cleaning Column Names</a></span></li></ul></li><li><span><a href="#Using-apply(),-map(),-and-applymap()" data-toc-modified-id="Using-apply(),-map(),-and-applymap()-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Using <code>apply()</code>, <code>map()</code>, and <code>applymap()</code></a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Apply()" data-toc-modified-id="Apply()-2.0.1"><span class="toc-item-num">2.0.1&nbsp;&nbsp;</span><code>Apply()</code></a></span></li><li><span><a href="#Map()" data-toc-modified-id="Map()-2.0.2"><span class="toc-item-num">2.0.2&nbsp;&nbsp;</span><code>Map()</code></a></span></li><li><span><a href="#applyMap()" data-toc-modified-id="applyMap()-2.0.3"><span class="toc-item-num">2.0.3&nbsp;&nbsp;</span><code>applyMap()</code></a></span></li><li><span><a href="#More-examples" data-toc-modified-id="More-examples-2.0.4"><span class="toc-item-num">2.0.4&nbsp;&nbsp;</span>More examples</a></span><ul class="toc-item"><li><span><a href="#Comparing-Map-and-Apply" data-toc-modified-id="Comparing-Map-and-Apply-2.0.4.1"><span class="toc-item-num">2.0.4.1&nbsp;&nbsp;</span>Comparing Map and Apply</a></span></li><li><span><a href="#Calculating-the-length-of-the-name" data-toc-modified-id="Calculating-the-length-of-the-name-2.0.4.2"><span class="toc-item-num">2.0.4.2&nbsp;&nbsp;</span>Calculating the length of the name</a></span></li><li><span><a href="#Converting-to-float-some-columns-with-applymap()" data-toc-modified-id="Converting-to-float-some-columns-with-applymap()-2.0.4.3"><span class="toc-item-num">2.0.4.3&nbsp;&nbsp;</span>Converting to float some columns with applymap()</a></span></li><li><span><a href="#Modifying-cloumns-names-with-apply()" data-toc-modified-id="Modifying-cloumns-names-with-apply()-2.0.4.4"><span class="toc-item-num">2.0.4.4&nbsp;&nbsp;</span>Modifying cloumns names with apply()</a></span></li></ul></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-2.0.5"><span class="toc-item-num">2.0.5&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-2.0.6"><span class="toc-item-num">2.0.6&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li></ul></li><li><span><a href="#Filtering-Data" data-toc-modified-id="Filtering-Data-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Filtering Data</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Creating-a-condition" data-toc-modified-id="Creating-a-condition-3.0.1"><span class="toc-item-num">3.0.1&nbsp;&nbsp;</span>Creating a condition</a></span></li><li><span><a href="#Filtering-df" data-toc-modified-id="Filtering-df-3.0.2"><span class="toc-item-num">3.0.2&nbsp;&nbsp;</span>Filtering df</a></span></li><li><span><a href="#Using-multiple-conditions" data-toc-modified-id="Using-multiple-conditions-3.0.3"><span class="toc-item-num">3.0.3&nbsp;&nbsp;</span>Using multiple conditions</a></span></li></ul></li></ul></li><li><span><a href="#More-Data-Manipulation" data-toc-modified-id="More-Data-Manipulation-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>More Data Manipulation</a></span><ul class="toc-item"><li><span><a href="#Setting-the-index" data-toc-modified-id="Setting-the-index-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Setting the index</a></span></li><li><span><a href="#Adding/removing-rows-and/or-columns" data-toc-modified-id="Adding/removing-rows-and/or-columns-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Adding/removing rows and/or columns</a></span></li><li><span><a href="#ðŸ’¡-Check-for-understanding" data-toc-modified-id="ðŸ’¡-Check-for-understanding-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>ðŸ’¡ Check for understanding</a></span></li></ul></li><li><span><a href="#Summary" data-toc-modified-id="Summary-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Summary</a></span></li></ul></div>

# Cleaning Data

## Null values

Null values (also known as missing values) are common in datasets and can hinder data analysis and modeling. It is essential to handle null values appropriately to ensure accurate and reliable results. Pandas provides various methods to clean and handle null values in datasets.

In Python, `None` is a special constant that represents the absence of a value. It is commonly used to indicate that a variable or function has no value or hasn't been assigned any value. For example, if a function does not explicitly return a value, it implicitly returns `None`.

On the other hand, `NaN` stands for "Not a Number" and is a special value used to represent missing or undefined numerical data. `NaN` is part of the floating-point representation and is commonly used in numeric data structures like Pandas DataFrames and Series to indicate missing or invalid numerical values.



### Cleaning Null Values

1. Checking for Null Values:
   - Use `isnull()` method to check for null values in a DataFrame or Series.
   - Use `notnull()` method to check for non-null values in a DataFrame or Series.

2. Dropping Null Values:
   - Use `dropna()` method to remove rows with null values from a DataFrame.
   - Use `dropna(axis=1)` to remove columns with null values.

3. Filling Null Values:
   - Use `fillna(value)` method to replace null values with a specific value.
   - Use `fillna(method='ffill')` to forward-fill null values with the previous non-null value.
   - Use `fillna(method='bfill')` to backward-fill null values with the next non-null value.

### Checking for Null Values

In [1]:
import pandas as pd

# Load Titanic dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/titanic_train.csv'
df = pd.read_csv(url)

In [2]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [3]:
# Checking for Null Values
df.isnull()  # Returns a DataFrame with True where values are null
# isnull is an alias of isna

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

When working with large datasets, using `isna()` or `isnull()` along with `any()` and `sum()` in Pandas becomes essential for quick and efficient data quality assessment.

In [4]:
# Check for null values in each column
df.isna().any() # do you have any null value?

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

sum() calculates the sum of each row, considering True as 1 and False as 0.

In [5]:
# Count the number of null values in each column
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

If we add the parameter `axis=1` with the `sum()` function, we can calculate the sum of each row (along the columns) of the DataFrame `df`. This results in a Series that contains the count of null values in each row.

In [6]:
df.isna().sum(axis=1) # missing values for each row

0      1
1      0
2      1
3      0
4      1
      ..
886    1
887    0
888    2
889    0
890    1
Length: 891, dtype: int64

### Dropping Null Values

In [7]:
# Dropping rows with Null Values
df.dropna(inplace=True)  # Removes rows with null values

In [9]:
df.reset_index(inplace=True)

However, as we can see below in the DataFrame, the rows with NaN values have not been removed. To execute the change, it is necessary to use the `inplace=True` option: `df.dropna(inplace=True)` or assign it to a variable such as df = df.dropna().

In [ ]:
# Dropping columns with  Null Values
df.dropna(axis=1)

In the `dropna()` method of Pandas DataFrame, the `subset`, `how`, and `thresh` parameters are used to control the behavior of dropping rows or columns containing NaN (null) values, when we don't want to drop them just because they have *one* null value:

- `subset`: It allows you to specify a subset of columns on which to apply the `dropna()` operation. Only the rows containing NaN values in the specified subset of columns will be dropped.

In [ ]:
df.tail()

In [ ]:
df.dropna(subset=['Cabin'])

- `how`: It specifies the condition for dropping rows. It can take the values 'any', which means to drop rows containing any NaN values in the `subset`, or 'all', which means to drop rows containing all NaN values in the `subset`.

In [ ]:
df.dropna(how='all').tail()

- `thresh`: It sets a minimum threshold for the number of non-null values that a row must have in the `subset` in order to be kept. Rows with fewer non-null values than the specified threshold will be dropped.

In [ ]:
df.dropna(thresh=3).tail() ###  It sets a minimum threshold for the number of non-null values

### Filling Null Values

`fillna()` is a Pandas method used to replace NaN (null) values in a DataFrame or Series with specified values.
- You can use `inplace=True` to modify the DataFrame directly.

In [ ]:
# Filling Null Values
df.fillna(-1).tail()  # Replaces null values with -1

Careful if we assign a different data type, since Pandas will change the data type of the whole column. For example:

In [ ]:
df.dtypes # age is a float

In [ ]:
df_na = df.fillna("na")
df_na.tail()

In [ ]:
df_na.dtypes # age is not a float anymore, it's an object now

To avoid this, we can select manually in which column to apply the `fillna()`

In [ ]:
df.Cabin.fillna("na").tail() ### aplying to this specific column 'Cabin'

We can also use the mean(), median() etc. to fill the null values.

In [ ]:
df.tail() # lets see where we have a NaN in Age in the last rows

In [ ]:
df.Age.fillna(df.Age.mean()).tail() # after filling with the mean, lets see how it would look --> "emputation"

- Two common methods for filling NaN values are `ffill`, which forward fills using the last valid value, and `bfill`, which backward fills using the next valid value.

In [ ]:
# Forward-fill null values in the Age column
df['Age'].fillna(method='ffill').tail()  #### putting the value that comes before to the NaN

In [ ]:
# Backward-fill null values in the Age column
df['Age'].fillna(method='bfill').tail()  #### putting the value that comes next to the NaN

### ðŸ’¡ Check for understanding

Consider the following DataFrame containing information about students:

```python
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Cathy', None, 'Eva'],
    'Age': [25, 30, None, 22, 28],
    'Gender': ['Female', None, 'Female', 'Male', None],
    'Score': [90, None, 78, None, 85]
}

df_students = pd.DataFrame(data)
```

Your task is to perform the following data cleaning tasks:

1. Check for null values in the DataFrame using `isna()` or `isnull()`.

2. Replace the null values in the 'Age' column with the average age of the students.

3. Replace the null values in the 'Gender' column with "Female".

4. Drop any rows that have null values in the 'Name' column.

5. Forward fill (ffill) the null values in the 'Score' column with the previous valid value.

6. After performing all the cleaning steps, print the cleaned DataFrame.

In [11]:
# Your code goes here:

import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Cathy', None, 'Eva'],
    'Age': [25, 30, None, 22, 28],
    'Gender': ['Female', None, 'Female', 'Male', None],
    'Score': [90, None, 78, None, 85]
}

df_students = pd.DataFrame(data)

In [12]:
df_students.isnull()

    Name    Age  Gender  Score
0  False  False   False  False
1  False  False    True   True
2  False   True   False  False
3   True  False   False   True
4  False  False    True  False

In [13]:
df_students.Age.fillna(df.Age.mean())

0    25.000000
1    30.000000
2    35.674426
3    22.000000
4    28.000000
Name: Age, dtype: float64

In [16]:
df_students.Gender.fillna("Female")

0    Female
1    Female
2    Female
3      Male
4    Female
Name: Gender, dtype: object

In [25]:
df_students.Name.dropna(inplace=True)

In [27]:
df_students['Score'].fillna(method='ffill')

0    90.0
Name: Score, dtype: float64

## Dealing with Duplicates

In data analysis, it's common to encounter duplicate values in datasets. Duplicates can distort our analysis and lead to incorrect conclusions. Fortunately, pandas provides efficient methods to handle duplicates.

### Identifying Duplicates

To identify duplicate rows in a DataFrame, we can use the `duplicated()` method, which returns a boolean Series indicating whether each row is a duplicate or not. We can then use the `sum()` method to count the total number of duplicates.

In [28]:
df.duplicated().sum()

0

In [29]:
df.duplicated().any()

False

To check for duplicates in specific columns, we can use the `duplicated()` method with the `subset` parameter, or just access first to the column and then check with duplicated().

In [30]:
# Check for duplicates in specific columns
df.duplicated(subset=['Age']).sum()

120

In [31]:
df.Age.duplicated().any()

True

### Removing Duplicates

To remove duplicates from a DataFrame, we can use the `drop_duplicates()` method. By default, this method keeps the first occurrence of each duplicated row and removes the rest.

In [32]:
# Remove duplicates and update the DataFrame
df.drop_duplicates(inplace=True) # we know there are none but this is how we would do it

### Removing Duplicates Based on Specific Columns

Sometimes, we may want to remove duplicates based on specific columns. We can pass a subset of column names to the `drop_duplicates()` method to achieve this.

In [ ]:
# Remove duplicates based on specific columns
df.drop_duplicates(subset=['Sex', 'Age']) #lets look at the number of rows if we do this --> same sex and same age than drop it

By default, `drop_duplicates()` keeps the first occurrence of each duplicated row. If we want to keep the last occurrence instead, we can set the `keep` parameter to `'last'`.

In [ ]:
# Keep the last occurrence of duplicates
df.drop_duplicates(keep='last', inplace=True) # we know there are none but this is how we would do it

### Resetting the Index

When removing duplicates, the DataFrame index may have gaps due to removed rows. To reset the index after removing duplicates, we can use the `reset_index()` method with the `drop=True` parameter.

In [33]:
# Remove duplicates and reset the index
df_without_duplicates = df.copy()
df_without_duplicates = df.drop_duplicates(subset=['Sex', 'Age'])
df_without_duplicates.tail() # look at the gaps in the index

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
175,857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
178,871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
179,872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
180,879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
182,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [34]:
df_without_duplicates.reset_index(drop=True, inplace=True)
df_without_duplicates.tail()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
90,857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
91,871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
92,872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
93,879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
94,889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

## Formatting Data

### Formatting Numeric Values


1. `round()` Method:
   - Rounds numeric values to a specified number of decimal places.

2. `format()` Method:
   - Formats numeric values as strings for better representation.

In [35]:
num = 123456.78910

In [38]:
round(num,2)

123456.8

In [40]:
format(num,'.2f') # .2f

'123456.79'

### Formatting Strings

Check the data structures lesson for more string operations and formatting. Here we'll just look at some of them.

1. **Using f-strings (formatted string literals):**
   - f-strings are introduced in Python 3.6 and provide a concise and readable way to format strings.
   - Place variables or expressions inside curly braces `{}` in the string, preceded by the `f` character.

In [41]:
name = "John"
age = 30
print(f"My name is {name} and I am {age} years old.")

My name is John and I am 30 years old.

2. **Using the `format()` method:**
   - The `format()` method can be applied to a string and accepts positional or keyword arguments to replace placeholders.
   - Placeholders are represented by curly braces `{}` and can be indexed or named.

In [42]:
print("My name is {} and I am {} years old.".format(name, age))

My name is John and I am 30 years old.

3. **Using `%` formatting:**
   - `%` formatting is an older method, similar to C-style formatting, but less recommended due to its limitations and lack of flexibility.
   - Placeholders are represented by `%` followed by format specifiers, like `%s` for strings and `%d` for integers.

In [43]:
print("My name is %s and I am %d years old." % (name, age))

My name is John and I am 30 years old.

Let's look at some methods for formatting strings.

In [44]:
string = 'HELLO world'

In [45]:
string.lower()

'hello world'

In [46]:
string.upper()

'HELLO WORLD'

In [47]:
string.title()

'Hello World'

In [48]:
len(string)

11

In [ ]:
'   Hello World   '.lstrip() ###  gets rid of the leading empty spaces

In [ ]:
'   Hello World   '.rstrip()

In [ ]:
'   Hello World   '.strip() ### gets rid of all spaces

In [49]:
string.split(" ")

['HELLO', 'world']

In [50]:
string.replace('HELLO','Hola')

'Hola world'

### Formatting Dates

We will study this in another Notebook.

## Cleaning Column Names

We can acccess the columns using `df.columns`

In [53]:
df.columns ###'columns' are attributes

Index(['index', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In order to modify them, we can assign new column names to `df.columns` by doing `df.columns = [list_of_new_column_names]` or we can use the `rename()` method to just modify a few of them.

In [54]:
# We need the whole list of new column names
# just modified SibSP to sib_sp

df.columns = ['passenger_id', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSP',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

df.columns

ValueError: Length mismatch: Expected axis has 13 elements, new values have 12 elements

In [ ]:
# We just need a dictionary with the columns we want to modify
# Getting the name back as it was

df.rename(columns= {'passenger_id': 'PassengerId'}, inplace=True)
print(df.columns)

In [ ]:
#### example in class:

name = []

# Using `apply()`, `map()`, and `applymap()`

- `apply()`
    - Apply a custom function to a Series.
    - Useful for element-wise transformations.
    - Example: `df['squared_numbers'] = df['numbers'].apply(lambda x: x ** 2)`

- `map()`
    - Transform Series elements based on a dictionary.
    - Replaces elements with corresponding dictionary values.
    - Example: `df['gender_mapped'] = df['gender'].map({'M': 'Male', 'F': 'Female'})`

- `applymap()`
    - Apply a custom function to every element in a DataFrame.
    - Useful for element-wise transformations on entire DataFrames.
    - Example: `df = df.applymap(lambda x: x.upper())`

###Â `Apply()`

In [63]:
# Applying a custom function using apply() 
def get_yob(age):
    return 1912-age #titanic sank in 1912, we will assume is when Age was recorded

df['yob'] = df['Age'].apply(get_yob)    ### creating a new column with the yob
df.head(3)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,yob
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1874.0
1,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1877.0
2,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,1858.0

In [64]:
# Apply and applymap are great for using lambda! This is the same as above

df['yob'] = df['Age'].apply(lambda age: 1912-age)

In the example above, we can see that to create a new column in pandas, we can simply assign a new Series or list to a new column name within the DataFrame.

To edit the information in a whole column in pandas, you can simply assign a new list or array of values to the column you want to modify.

In [65]:
df['Fare'] = df['Fare'].apply(lambda num: round(num, 2))
df['Fare']

0      71.28
1      53.10
2      51.86
3      16.70
4      26.55
       ...
178    52.55
179     5.00
180    83.16
181    30.00
182    30.00
Name: Fare, Length: 183, dtype: float64

###Â `Map()`

In [66]:
# Using map() to transform the 'Sex' column in binary 0 male and 1 for female
gender_mapping = {'male': 0, 'female': 1} 
df['Gender_mapped'] = df['Sex'].map(gender_mapping)
df.head()

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,yob,Gender_mapped
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C,1874.0,1
1,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S,1877.0,1
2,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.86,E46,S,1858.0,0
3,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.70,G6,S,1908.0,1
4,11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.55,C103,S,1854.0,1

In [67]:
# Lets do the same with apply and lambda
df.Sex.apply(lambda x: 0 if x=="male" else 1)

0      1
1      1
2      0
3      1
4      1
      ..
178    1
179    0
180    1
181    1
182    0
Name: Sex, Length: 183, dtype: int64

###Â `applyMap()`

In [ ]:
# Using applymap() to convert all string columns to uppercase
df = df.applymap(lambda x: x.upper() if isinstance(x, str) else x)

# Displaying the modified DataFrame
df.head()

In [ ]:
df = df.applymap(lambda x: x.upper() if type(x)==str else x)

### More examples

#### Comparing Map and Apply

We have a column called "Embarked" containing three possible values: 'C', 'Q', and 'S'. We want to map these values to 0, 1 and 2. In this case, `apply()` with a lambda function would be complex due to the if-elif-else conditions, but `map()` can handle it more easily.

In [ ]:
# Mapping 'Embarked' values to their full names using map()
embarked_mapping = {'C': 0, 'Q': 1, 'S': 2}
df['Embarked_nr'] = df['Embarked'].map(embarked_mapping)

# Display the first few rows of the updated DataFrame
df[['Name', 'Embarked_nr']].head()

Why is it a float?

In [ ]:
df.isna().sum() # Because Embarked has null values and it converted it to float to handle NaN value

In [ ]:
# Mapping 'Embarked' values to their full names using apply() and a lambda function
df['Embarked'].apply(lambda x: 0 if x == 'C' else (1 if x == 'Q' else 2))

#Note that here it doesn't convert it to float

#### Calculating the length of the name

What if we wanted to create a new column with the length of the name?

In [ ]:
df['Name_length'] = df.Name.apply(len)
df.head()

#### Converting to float some columns with applymap()

Lets look just as an example, how to make float all the following columns: "PassengerId", "Survived", "Pclass"

In [ ]:
df[["PassengerId", "Survived", "Pclass"]].applymap(float)

#### Modifying cloumns names with apply()

In [ ]:
# I could also use the apply function by converting df.columns to Series
pd.Series(df.columns).apply(lambda col: col.lower())

### ðŸ’¡ Check for understanding

Make the column Embarked_nr as an integer type.

- If you get an error, read the error, and think how you should proceed.
- If you decide to fill the null values, use the mode() since its a categorical variable.
- If you get another error, look at what mode() is returning in order to fix the error and convert to integer the Embarked_nr column.

In [ ]:
# Your code goes here

### ðŸ’¡ Check for understanding

You are given a dataset of students' exam scores here: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/student_performance.csv. Your task is to perform the following operations using pandas:

1. Read the CSV file into a DataFrame.
2. Create a new column "total_score" that calculates the total score for each student by summing their "math score," "reading score," and "writing score."
3. Create a new column "grade" that assigns a grade to each student based on the following criteria:
   - If the total score is >= 90, the grade is "A."
   - If the total score is >= 80 and < 90, the grade is "B."
   - If the total score is >= 70 and < 80, the grade is "C."
   - If the total score is >= 60 and < 70, the grade is "D."
   - If the total score is < 60, the grade is "F."
4. Convert all student names in the "gender" column to uppercase.
5. Create a new column "is_passed" that indicates whether each student has passed the exam or not. If the total score is >= 60, the student has passed; otherwise, they have failed.

In [ ]:
df_students = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/student_performance.csv")

In [ ]:
# Your code goes here

# Filtering Data

One of the primary tasks in dataset analysis is filtering rows.

When filtering DataFrames in Pandas, you can use boolean indexing to select specific rows based on certain conditions. Here's a step-by-step explanation:

1. Identify the column(s) you want to use as a filter condition. For example, in `housing_df` the column named 'SalePrice'.

2. Create a condition using a comparison operator (e.g., `>`, `<`, `==`, etc.) and the column(s) you want to filter. For instance, to filter all rows where the 'SalePrice' is greater than 10000, you would use `condition = housing_df['SalePrice'] > 10000`.

3. Use the condition to filter the DataFrame. You can do this by passing the condition inside square brackets to the DataFrame. For example, `filtered_df = housing_df[condition]` will create a new DataFrame `filtered_df` containing only the rows where the 'SalePrice' is greater than 10000.

Keep in mind that the condition should evaluate to a boolean Series with the same length as the DataFrame, indicating which rows to include (True) or exclude (False).

You can also combine multiple conditions using logical operators like `&` for 'and' and `|` for 'or'. For instance, to filter rows where the 'SalePrice' is greater than 10000 and the 'FullBath' is more than 1, you can use `condition = (housing_df['SalePrice'] > 10000) & (housing_df['FullBath'] > 1)`.

Filtering allows you to extract specific subsets of data from your DataFrame, making it easier to analyze and work with the data that meets your criteria.

### Creating a condition

In [55]:
df.Fare

0      71.2833
1      53.1000
2      51.8625
3      16.7000
4      26.5500
        ...
178    52.5542
179     5.0000
180    83.1583
181    30.0000
182    30.0000
Name: Fare, Length: 183, dtype: float64

In [56]:
df.Fare.mean()

78.68246885245901

In [57]:
condition = df.Fare > df.Fare.mean()
condition

0      False
1      False
2      False
3      False
4      False
       ...
178    False
179    False
180     True
181    False
182    False
Name: Fare, Length: 183, dtype: bool

### Filtering df

In [58]:
filtered_df = df[condition]
filtered_df

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
10,62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
13,88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
19,118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
24,139,140,0,1,"Giglio, Mr. Victor",male,24.0,0,0,PC 17593,79.2000,B86,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
166,789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.0,0,0,PC 17593,79.2000,B82 B84,C
168,802,803,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0000,B96 B98,S
171,820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
173,835,836,1,1,"Compton, Miss. Sara Rebecca",female,39.0,1,1,PC 17756,83.1583,E49,C
180,879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

In [59]:
# or what is the same, inside the brackets I give True/False Series in order to filter
df[df.Fare > df.Fare.mean()]

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
10,62,63,0,1,"Harris, Mr. Henry Birkhardt",male,45.0,1,0,36973,83.4750,C83,S
13,88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
19,118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
24,139,140,0,1,"Giglio, Mr. Victor",male,24.0,0,0,PC 17593,79.2000,B86,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...
166,789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.0,0,0,PC 17593,79.2000,B82 B84,C
168,802,803,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0000,B96 B98,S
171,820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
173,835,836,1,1,"Compton, Miss. Sara Rebecca",female,39.0,1,1,PC 17756,83.1583,E49,C
180,879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

### Using multiple conditions

In [60]:
# We can combine boolean operators with filters to add conditions
# boolean operators: and is &, or is |
df[(df.Fare > df.Fare.mean()) & (df.Fare <= 50)]

Empty DataFrame
Columns: [index, PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [61]:
# To avoid using many filters we can also use .isin()

df[(df['Fare'] > 100) & (df['Pclass'].isin([2,3]))]

Empty DataFrame
Columns: [index, PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [62]:
# We can also use between()

df[df['Fare'].between(90,100)]

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
38,224,225,1,1,"Hoyt, Mr. Frederick Maxfield",male,38.0,1,0,19943,90.0000,C93,S
40,245,246,0,1,"Minahan, Dr. William Edward",male,44.0,2,0,19928,90.0000,C78,Q
51,291,292,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19.0,1,0,11967,91.0792,B49,C
81,412,413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q
95,484,485,1,1,"Bishop, Mr. Dickinson H",male,25.0,1,0,11967,91.0792,B49,C
96,486,487,1,1,"Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)",female,35.0,1,0,19943,90.0000,C93,S
106,520,521,1,1,"Perreault, Miss. Anne",female,30.0,0,0,12749,93.5000,B73,S
171,820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S

# More Data Manipulation

## Setting the index

To set an index in pandas, you can use the `set_index()` method of the DataFrame. This method allows you to specify which column you want to use as the index for the DataFrame.

In [ ]:
df.set_index('PassengerId',inplace=True)
df.head()

## Adding/removing rows and/or columns

To add or remove rows and/or columns from a pandas DataFrame, you can use the following methods:

1. Adding rows:
   - Use the `append()` method to add rows to the DataFrame.

2. Removing rows:
   - Use the `drop()` method with the row index or label to remove specific rows.

3. Adding columns:
   - Using `df[new_column]`, you simply assign a list, Series, or scalar value to the new column name
   - Assign a new column to the DataFrame using bracket notation or the `assign()` method.

4. Removing columns:
   - Use the `drop()` method with the column name and `axis=1` to remove specific columns.
   - Alternatively, you can use the `del` keyword to remove a column in-place.

In [ ]:
df.drop(1) # This deletes the row with index 1

In [ ]:
# This deletes a column

df.drop('Name',axis=1,inplace=True)
df.head()

In [ ]:
# This creates a new column

df["Survived_bool"] = df['Survived'].map({0: False, 1: True})
df

## ðŸ’¡ Check for understanding

Use the `supermarket_sales.csv` file for this task.

1. **Load the Data**: Use pandas to load the `supermarket_sales.csv` file into a DataFrame.

2. **Null Values**: Check if the DataFrame has any null values. If there are any, count the number of null values in each column.

5. **Formatting Data**: Round any floating point numbers in the DataFrame to two decimal places.

6. **Cleaning Column Names**: Ensure all column names are in lowercase and replace any spaces in the column names with underscores.

7. **Using `apply()`, `map()`, and `applymap()`**: Create a new column called 'total_cost' which is the product of the 'quantity' and 'unit_price' columns (assuming these columns exist in your dataset). Use the `apply()` function for this.

8. **Filtering Data**: Filter the DataFrame to only include rows where 'total_cost' is greater than the average 'total_cost'.

9. **Setting the Index**: Set the 'invoice_id' column (or any other unique identifier) as the index of the DataFrame.

In [ ]:
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/supermarket_sales.csv'

In [ ]:
# Your code goes here

# Summary

1. Null Values:
   - Null values (also known as missing values) can hinder data analysis and modeling.
   - Use `isnull()` or `isna()` to check for null values in a DataFrame or Series.
   - Use `any()` and `sum()` to efficiently assess data quality.
   - Use `dropna()` to remove rows or columns with null values from a DataFrame.
   - Parameters like subset, how, and thresh can control the behavior of dropping rows or columns.
   - Use `fillna()` to replace null values with specific values, such as `mean()`, `median()`, or forward/backward fill.

5. Formatting Data:
   - Use `round()` and `format()` to format numeric values.
   - Use f-strings, `format()` or % to format strings and use string methods like `lower()`, `upper()`, `title()`, `strip()`, `split()`, and `replace()`.

6. Cleaning Column Names:
   - Use df.columns to access column names.
   - Modify column names using df.columns or `rename()`.

7. Using `apply()`, `map()`, and `applymap()`:
   - `apply()`: Applies a custom function to a Series.
   - `map()`: Transforms Series elements based on a dictionary.
   - `applymap()`: Applies a custom function to every element in a DataFrame.

8. Filtering Data:
   - Filter rows in a DataFrame using boolean indexing.
   - Use comparison operators (<, >, ==) to create conditions.
   - Combine multiple conditions using logical operators (& for 'and', | for 'or').

9. Setting the Index:
   - Use `set_index()` to set an index for the DataFrame.

10. Adding/Removing Rows and Columns:
   - Use `append()` to add rows to the DataFrame.
   - Use `drop()` with the row index/label to remove specific rows.
   - Use bracket notation, `assign()`, or `drop()` with axis=1 to add/remove columns.